specters312/SVD_DUMP/Atmel/ATSAM3X2E.svd
        <register>
          <name>CMPMUPD0</name>
          <description>PWM Comparison 0 Mode Update Register</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV1</name>
          <description>PWM Comparison 1 Value Register</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD1</name>
          <description>PWM Comparison 1 Value Update Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM1</name>
          <description>PWM Comparison 1 Mode Register</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMUPD1</name>
          <description>PWM Comparison 1 Mode Update Register</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV2</name>
          <description>PWM Comparison 2 Value Register</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD2</name>
          <description>PWM Comparison 2 Value Update Register</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM2</name>
          <description>PWM Comparison 2 Mode Register</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMUPD2</name>
          <description>PWM Comparison 2 Mode Update Register</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV3</name>
          <description>PWM Comparison 3 Value Register</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD3</name>
          <description>PWM Comparison 3 Value Update Register</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM3</name>
          <description>PWM Comparison 3 Mode Register</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMUPD3</name>
          <description>PWM Comparison 3 Mode Update Register</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV4</name>
          <description>PWM Comparison 4 Value Register</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD4</name>
          <description>PWM Comparison 4 Value Update Register</description>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM4</name>
          <description>PWM Comparison 4 Mode Register</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMUPD4</name>
          <description>PWM Comparison 4 Mode Update Register</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV5</name>
          <description>PWM Comparison 5 Value Register</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD5</name>
          <description>PWM Comparison 5 Value Update Register</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
