specters312/SVD_DUMP/Atmel/ATSAM3X2E.svd
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-9</dimIndex>
          <name>DEVEPTCFG%s</name>
          <description>Device Endpoint Configuration Register (n = 0)</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ALLOC</name>
              <description>Endpoint Memory Allocate</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPBK</name>
              <description>Endpoint Banks</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_BANK</name>
                  <description>Single-bank endpoint</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BANK</name>
                  <description>Double-bank endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_BANK</name>
                  <description>Triple-bank endpoint</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPSIZE</name>
              <description>Endpoint Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8_BYTE</name>
                  <description>8 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BYTE</name>
                  <description>16 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BYTE</name>
                  <description>32 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64_BYTE</name>
                  <description>64 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_BYTE</name>
                  <description>128 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256_BYTE</name>
                  <description>256 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_BYTE</name>
                  <description>512 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024_BYTE</name>
                  <description>1024 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>The endpoint direction is OUT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <description>The endpoint direction is IN (nor for control endpoints).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOSW</name>
              <description>Automatic Switch</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRPT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBTRANS</name>
              <description>Number of transaction per microframe for isochronous endpoint</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_TRANS</name>
                  <description>reserved to endpoint that does not have the high-bandwidth isochronous capability.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_TRANS</name>
                  <description>default value: one transaction per micro-frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_TRANS</name>
                  <description>2 transactions per micro-frame. This endpoint should be configured as double-bank.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_TRANS</name>
                  <description>3 transactions per micro-frame. This endpoint should be configured as triple-bank.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-9</dimIndex>
          <name>DEVEPTISR%s</name>
          <description>Device Endpoint Status Register (n = 0)</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXINI</name>
              <description>Transmitted IN Data Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOUTI</name>
              <description>Received OUT Data Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXSTPI</name>
              <description>Received SETUP Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UNDERFI</name>
              <description>Underflow Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKOUTI</name>
              <description>NAKed OUT Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HBISOINERRI</name>
              <description>High bandwidth isochronous IN Underflow Error Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKINI</name>
              <description>NAKed IN Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HBISOFLUSHI</name>
              <description>High Bandwidth Isochronous IN Flush Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERFI</name>
              <description>Overflow Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLEDI</name>
              <description>STALLed Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCERRI</name>
              <description>CRC Error Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHORTPACKET</name>
              <description>Short Packet Interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTSEQ</name>
              <description>Data Toggle Sequence</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Data0 toggle sequence</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Data1 toggle sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Data2 toggle sequence (for high-bandwidth isochronous endpoint)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>MData toggle sequence (for high-bandwidth isochronous endpoint)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRORTRANS</name>
              <description>High-bandwidth isochronous OUT endpoint transaction error Interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NBUSYBK</name>
              <description>Number of Busy Banks</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_BUSY</name>
                  <description>0 busy bank (all banks free)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_BUSY</name>
                  <description>1 busy bank</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BUSY</name>
                  <description>2 busy banks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_BUSY</name>
                  <description>3 busy banks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBK</name>
              <description>Current Bank</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK0</name>
                  <description>Current bank is bank0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK1</name>
                  <description>Current bank is bank1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2</name>
                  <description>Current bank is bank2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWALL</name>
              <description>Read-write Allowed</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLDIR</name>
              <description>Control Direction</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFGOK</name>
              <description>Configuration OK Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BYCT</name>
              <description>Byte Count</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-9</dimIndex>
          <name>DEVEPTICR%s</name>
          <description>Device Endpoint Clear Register (n = 0)</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXINIC</name>
              <description>Transmitted IN Data Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXOUTIC</name>
              <description>Received OUT Data Interrupt Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSTPIC</name>
              <description>Received SETUP Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UNDERFIC</name>
              <description>Underflow Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKOUTIC</name>
              <description>NAKed OUT Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HBISOINERRIC</name>
              <description>High bandwidth isochronous IN Underflow Error Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKINIC</name>
              <description>NAKed IN Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HBISOFLUSHIC</name>
              <description>High Bandwidth Isochronous IN Flush Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVERFIC</name>
              <description>Overflow Interrupt Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLEDIC</name>
              <description>STALLed Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRCERRIC</name>
              <description>CRC Error Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHORTPACKETC</name>
              <description>Short Packet Interrupt Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-9</dimIndex>
          <name>DEVEPTIFR%s</name>
          <description>Device Endpoint Set Register (n = 0)</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXINIS</name>
              <description>Transmitted IN Data Interrupt Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXOUTIS</name>
              <description>Received OUT Data Interrupt Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSTPIS</name>
              <description>Received SETUP Interrupt Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UNDERFIS</name>
              <description>Underflow Interrupt Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKOUTIS</name>
              <description>NAKed OUT Interrupt Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HBISOINERRIS</name>
              <description>High bandwidth isochronous IN Underflow Error Interrupt Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKINIS</name>
              <description>NAKed IN Interrupt Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HBISOFLUSHIS</name>
              <description>High Bandwidth Isochronous IN Flush Interrupt Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVERFIS</name>
              <description>Overflow Interrupt Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLEDIS</name>
              <description>STALLed Interrupt Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRCERRIS</name>
              <description>CRC Error Interrupt Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHORTPACKETS</name>
              <description>Short Packet Interrupt Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NBUSYBKS</name>
              <description>Number of Busy Banks Interrupt Set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
